[
  {
    "id": 4437573,
    "type": "question",
    "title": "bash assign default value",
    "htmlBody": "<blockquote>\n  <p>${parameter:=word}\n                Assign Default Values.  If parameter is unset or null, the\n  expansion of word is assigned to\n  parameter.  The value of parameter is\n  then  substituted.   Positional \n  parameters  and  special\n                parameters may not be assigned to in this way.</p>\n</blockquote>\n\n<p>I thought I could use this feature to write <code>${LONG_VARIABLE_NAME:=hello}</code> instead of the longer <code>LONG_VARIABLE_NAME=${LONG_VARIABLE_NAME:-hello}</code>, but now bash also tries to execute 'hello' and that gives a command not found. Any way to avoid that? Or will I have to stick to the latter? Can someone give an example where the assign default is actually useful?</p>\n"
  },
  {
    "id": 39126853,
    "type": "answer",
    "title": null,
    "htmlBody": "<p>One day after releasing Markdown, John Gruber posted a <a href=\"http://daringfireball.net/2004/03/dive_into_markdown\" rel=\"nofollow noreferrer\">long explanation</a> of his motivations for creating Markdown. He stated in part:</p>\n<blockquote>\n<p>You don’t need to “preview” an email before you send it — you write it, you read it, you edit it, right there.</p>\n<p>In fact, I love writing email. Email is my favorite writing medium. I’ve sent over 16,000 emails in the last five years. The conventions of plain text email allow me to express myself clearly and precisely, without ever getting in my way.</p>\n<p>Thus, Markdown. Email-style writing for the web.</p>\n</blockquote>\n<p>I can't find it now, but I recall him explaining elsewhere that this was a primary factor in the choices he made (see <a href=\"https://stackoverflow.com/a/46058126/866026\">the other answer</a>). Many of the syntax rules were derived from the way people were already using plain text to author emails. For example, (as the OP found and noted in a comment) he <a href=\"https://alpha.app.net/gruber/post/616857\" rel=\"nofollow noreferrer\">stated</a> many years later:</p>\n<blockquote>\n<p>Asterisks were never in doubt. Underscores were added as a secondary syntax because enough people seemed to use them in email.</p>\n</blockquote>\n<p>As I recall, the same was true of asterisks. Many people were already using them in email.</p>\n"
  }
]